{
    "version": "https://jsonfeed.org/version/1",
    "title": "HERE",
    "description": "",
    "home_page_url": "https://shoobieshoobie.github.io/here",
    "feed_url": "https://shoobieshoobie.github.io/here/feed.json",
    "user_comment": "",
    "author": {
        "name": "Shoob"
    },
    "items": [
        {
            "id": "https://shoobieshoobie.github.io/here/the-haar/",
            "url": "https://shoobieshoobie.github.io/here/the-haar/",
            "title": "The Haar",
            "summary": "BOOK - Author: David Sodergren | Opinion: 2 out of 5 The Haar is a brief horror novel. I had high hopes for this book. The premise is based around an elderly woman in the scottish countryside whose town is being bought up and demolished&hellip;",
            "content_html": "<p class=\"align-center\">BOOK  - Author: David Sodergren | Opinion: 2 out of 5</p>\n<hr>\n<p>The Haar is a brief horror novel. I had high hopes for this book. The premise is based around an elderly woman in the scottish countryside whose town is being bought up and demolished by an American business mogul. Very few residents are holding against the buyout at the beginning of the story. After not too long the woman comes across a dying sea creature unlike anything she's heard of. It sounds like a cross between a jellyfish and an octopus with a single eye floating in its gelatenous mass.</p>\n<p>What follows is what I would describe as nothing more than revenge fantasy. The creature and the woman begin fighting back against the people coercing her to leave her home. There's gore, there's sex, there's even romance. But there isn't a sliver of true excitement. The most interesting aspect of the book is the few, small instances we see the sea creature learning about human concepts. But this was hardly a focus of the book.</p>\n<p>I think if the book had taken it's time and given us some better characterization, it would have been fine, but as is it simply feels bland.</p>\n<hr>\n<p><strong>Alternatives</strong></p>\n<p>For witnessing the growth of something inhuman as it fumbles towards humanity: <strong>Borne</strong> by <em>Jeff Vandermeer</em></p>\n<p>For horror with romantic elements and an emotional payoff: <strong>The Cipher</strong> by <em>Kathe Koja</em></p>",
            "author": {
                "name": "Shoob"
            },
            "tags": [
                   "horror",
                   "book review",
                   "Critiques"
            ],
            "date_published": "2024-09-17T23:32:06-07:00",
            "date_modified": "2024-09-17T23:32:06-07:00"
        },
        {
            "id": "https://shoobieshoobie.github.io/here/passions/",
            "url": "https://shoobieshoobie.github.io/here/passions/",
            "title": "Passions",
            "summary": "I've found that nothing more in life drives me than fleeting passions. I've needed a way to centralize the things that excite me. I enjoy sharing with others what I'm up to and the things I'm engaging in lately. Social media sites like Facebook, Instagram,&hellip;",
            "content_html": "<p>I've found that nothing more in life drives me than fleeting passions. I've needed a way to centralize the things that excite me. I enjoy sharing with others what I'm up to and the things I'm engaging in lately. Social media sites like Facebook, Instagram, TikTok, etc. have all become too overwhelming and too focused on generating money. I've started blogs in the past, I'm not sure why I think this one will be any different? Maybe because I'm hoping to encourage my friends to create their own little hubs on the internet.</p>\n<p>Or maybe house is a better word. I've started thinking of this little web project as a digital home where each page is a different room. I can decorate it the way I want and include whatever content I'd like. I can even limit who has access.</p>\n<p>I think in the past I've expected whatever blogs I have started to grow beyond my immediate circle. But this time around, my focus is solely on communicating to all of you who I already know. My plan is to update this site at least a couple of times a week.</p>\n<p>I'm exhausted by how many ideas I generate return to the idea of getting money. I mostly just want to create things with other people and by myself. I hope that by using this site, I can not only share what's going on and what I'm reading and what I'm interested in lately but also remind myself of what I want to focus on, what projects I'm working on, and what my long term goals are.</p>\n<p>It's been a long time since I've done any sort of blogging and I've done very little writing in general in a while, so I'm substantially out of practice. I just wanted to get something out there to share. </p>",
            "author": {
                "name": "Shoob"
            },
            "tags": [
                   "Philosophy 404"
            ],
            "date_published": "2024-09-16T23:01:16-07:00",
            "date_modified": "2024-09-16T23:01:16-07:00"
        }
    ]
}
